app/Models/PerangkatTautanModel.php

SELECT *
FROM `table_perangkat_tautan`
SELECT COUNT(*) AS `numrows`
FROM `table_perangkat_tautan`
---
    public function get_all()
    {
        $builder = $this->db->table($this->table_name . ' as tpt');

         $builder->select('*, tpt.id as tpt_id');
         $builder->join($this->table_materi_name . ' as tm', 'tpt.id_materi=tm.id');

        $query = $builder->get();
        $manyData = $builder->countAllResults();

INSERT INTO `table_perangkat_tautan` (`nama`, `deskripsi`, `url`, `id_materi`) VALUES (NULL, NULL, NULL, -1)
---
    public function insert_new($data){
        $query = $this->db->table($this->table_name)->insert($data);